app/Controllers/Admin/AdminMainController.php

    private function defaults()
    {
        $config = config('AdminMenu');


        $this->pageData['validation'] = null;
        $this->pageData['scripts'] = '';

        $this->pageData['isCropper'] = false;

        AuthUtils::checkRememberMe();

        if (session()->get('adminUser')) {
            $this->userData = session()->get('adminUser');
        }

        $langModel = new LangModel();
        $langList = array_column($langModel->findAll(), 'title', 'lang');
---
SELECT *
FROM `lang`