app/Controllers/Admin/Posts.php

SELECT *
FROM `posts`
WHERE `related_id` = '475'
---
    public function index(): string
    {

        $this->currentView = "Admin/{$this->mod}/index";

        $model = new PostsModel();

        $where = ["{$model->table}.related_id" => 0];
        if ($this->request->getGet('table_search') && strlen(trim($this->request->getGet('table_search')))) {

            $where['like'] = [
                "{$model->table}.title" => trim($this->request->getGet('table_search')),
            ];
        }


        $pager = $model->postsPagination($where, ['col' => 'created_at', 'sort' => 'DESC']);


        foreach ($pager['items'] as $item) {
            if ($item->related_id == 0) {
                $item->nodes = [];
                $relItems = $model->where(['related_id' => $item->id])->findAll();

SELECT *
FROM `posts`
 LIMIT 1
---
    public function edit($id = 0, $pageNum = 0)
    {


        $this->currentView = "Admin/{$this->mod}/edit";
        $this->_addScript('assets/admin/js/post-editor.js');

        $this->pageData['editor_json_data'] = json_encode(json_decode($this->request->getPost('editor_json_data')));

        $item = new \stdClass();

        $model = new PostsModel();

        $this->pageData['lang'] = $this->request->getGet('lang') ?? ADMIN_DEF_LANG;
        $this->pageData['related_id'] = $this->request->getGet('related_id') ?? 0;
        $this->pageData['related_item'] = $model->first($this->pageData['related_id']);