app/Config/Routes/Front.php



$db = Database::connect();
$query = $db->table('lang')->select('lang')->get();
$locales = array_column($query->getResultArray(), 'lang');

$categoriesQuery = $db->table('news_categories')->select('news_categories.slug,news_categories.id')
    ->join('news_categories_ml', "news_categories_ml.parent_id = news_categories.id")
    ->get()->getResultArray();
---
SELECT `lang`
FROM `lang`
SELECT `news_categories`.`slug`, `news_categories`.`id`
FROM `news_categories`
JOIN `news_categories_ml` ON `news_categories_ml`.`parent_id` = `news_categories`.`id`