app/Controllers/MainController.php

SELECT *
FROM `lang`
WHERE `status` = 1
---
    protected function defaults()
    {

        $config = new App();
        $this->_lang = $config->defaultLocale;

        $this->pageData['validation'] = null;

        AuthUtils::checkRememberMeFront();

        if (session()->get('user')) {
            $this->userData = session()->get('user');
        }

        $this->pageData['userData'] = $this->userData;

        $uri = service('uri');



        $firstSegment = $uri->getSegment(1);
        $secondSegment = $uri->setSilent()->getSegment(2);


        $langModel = new LangModel();
        $langList = array_column($langModel->where('status', 1)->findAll(), 'title', 'lang');

SELECT *
FROM `menu_sections`
WHERE `url` = 'main-menu'
 LIMIT 1
---

        $menuSectionModel = new MenuSectionsModel();

        $mainSection = $menuSectionModel->where('url', 'main-menu')->first();