app/Controllers/Post.php

SELECT *
FROM `news_categories`
WHERE `slug` = 'event'
 LIMIT 1
---
    public function index($slug): string
    {

        $categoryModel = new NewsCategoryModel();
        $category = $categoryModel->where(['slug' => urldecode($slug)])->first();

SELECT *
FROM `posts`
WHERE `id` = '67'
AND `lang` = 'en'
 LIMIT 1
---
    public function view($slug, $id)
    {
        $langPageLinks = LangUtils::langLinksBuilderPost();
        if ($langPageLinks) {
            $this->pageData['langPageLinks'] = $langPageLinks;
        }

        $this->currentView = 'posts/view';

        $newsModel = new PostsModel();
        $item = $newsModel->where(['id' => $id, 'lang' => $this->_lang])->first();