app/Models/AdminLabelsModel.php

SELECT `admin_labels`.*, `admin_labels_ml`.`text`, `admin_labels_ml`.`lang`
FROM `admin_labels`
JOIN `admin_labels_ml` ON `admin_labels_ml`.`parent_id` = `admin_labels`.`id`
WHERE `admin_labels_ml`.`lang` = 'en'
ORDER BY `admin_labels`.`id` DESC
---
    public function getAllItems($lang, $pageNum = 0, $perPage = 0)
    {

        $tblMl = $this->table . ML_TABLE;


        return $this->select("{$this->table}.*, {$tblMl}.text, {$tblMl}.lang")
            ->join($tblMl, "{$tblMl}.parent_id = {$this->table}.id")
            ->where("{$tblMl}.lang", $lang)
            ->orderBy("{$this->table}.id", 'DESC')
            ->findAll();