app/Models/FrontendLabelsModel.php

SELECT `frontend_labels`.*, `frontend_labels_ml`.`text`, `frontend_labels_ml`.`lang`
FROM `frontend_labels`
JOIN `frontend_labels_ml` ON `frontend_labels_ml`.`parent_id` = `frontend_labels`.`id`
WHERE `frontend_labels_ml`.`lang` = 'en'
AND `type` = 'label'
ORDER BY `frontend_labels`.`id` DESC
---
    public function getAllItems($lang, $pageNum = 0, $perPage = 0, $where = false)
    {
        $tblMl = $this->table . ML_TABLE;

        $query = $this->select("{$this->table}.*, {$tblMl}.text, {$tblMl}.lang")
            ->join($tblMl, "{$tblMl}.parent_id = {$this->table}.id")
            ->where("{$tblMl}.lang", $lang)->orderBy("{$this->table}.id", 'DESC');
        if ($where) {
            $query->where($where);
        }

        return $query->findAll();