app/Models/NewsCategoryModel.php

    public function getAllItems($lang, int $pageNum = 0, $where = false, $order = [])
    {

        $tblMl = $this->table . ML_TABLE;

        $pageNum = $pageNum > 0 ? $pageNum - 1 : 0;

        $query = $this->select("{$this->table}.*, {$tblMl}.title, {$tblMl}.lang")
            ->join($tblMl, "{$tblMl}.parent_id = {$this->table}.id")
            ->where("{$tblMl}.lang", $lang);

        if ($pageNum) {
            $query->limit(FRONT_PER_PAGE, $pageNum);
        }

        if ($where) {
            $query->where($where);
        }

        if (isset($order['col']) && isset($order['sort'])) {
            $query->orderBy($order['col'], $order['sort']);
        } else {
            $query->orderBy("{$this->table}.id", 'DESC');

        }

        return $query->findAll();
---
SELECT `news_categories`.*, `news_categories_ml`.`title`, `news_categories_ml`.`lang`
FROM `news_categories`
JOIN `news_categories_ml` ON `news_categories_ml`.`parent_id` = `news_categories`.`id`
WHERE `news_categories_ml`.`lang` = 'en'
ORDER BY `news_categories`.`id` DESC