app/Libraries/LangUtils.php

SELECT *
FROM `posts`
WHERE `posts`.`id` = '67'
SELECT *
FROM `posts`
WHERE `id` = '67'
OR `related_id` = '67'
---
    public static function langLinksBuilderPost(): array
    {

        $langPageLinks = [];
        $uri = service('uri');
        $idSegment = $uri->getSegment(4);

        $catSegment = $uri->getSegment(2);


        $postModel = new PostsModel();
        $item = $postModel->find($idSegment);

        if (!empty($item)) {


            if (isset($item->related_id) && $item->related_id) {

                $rel_items = $postModel
                    ->orWhere(['id' => $item->related_id])
                    ->orWhere(['related_id' => $item->related_id])
                    ->findAll();
            } else {
                $rel_items = $postModel
                    ->orWhere(['id' => $item->id])
                    ->orWhere(['related_id' => $item->id])
                    ->findAll();